{
  "backend/main.mo": "Motoko canister managing blog posts, contact forms, and user profiles with admin‑restricted CRUD operations and authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of concise summaries for all frontend files describing their roles and functionality.",
  "frontend/index.css": "Tailwind CSS setup defining global design tokens, light/dark theme variables, and base styles.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main TypeScript entry point.",
  "frontend/README.md": "Project documentation explaining stack differences, features, and local development setup for the React+Motoko website.",
  "frontend/src/App.tsx": "Main React router configuration defining all public and admin routes and wrapping the app with layout and theme providers.",
  "frontend/src/components/admin/AdminGuard.tsx": "Admin access guard enforcing Internet Identity login and admin role before rendering protected pages.",
  "frontend/src/components/admin/AdminHeader.tsx": "Admin header component providing navigation links and authentication actions.",
  "frontend/src/components/admin/AdminLayout.tsx": "Wrapper layout for admin pages with guard, header, and routed content area.",
  "frontend/src/components/admin/AuthButton.tsx": "Login/logout button using Internet Identity with loading and error handling.",
  "frontend/src/components/admin/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and save their profile name.",
  "frontend/src/components/public/Footer.tsx": "Public site footer with links, contact info, and social media icons.",
  "frontend/src/components/public/Header.tsx": "Responsive public header with navigation menus and mobile drawer.",
  "frontend/src/components/public/PublicLayout.tsx": "Public-facing layout composing header, routed content, and footer.",
  "frontend/src/components/public/ui/ButtonLink.tsx": "Button-styled link component wrapping router Link with button variants.",
  "frontend/src/components/public/ui/SectionHeading.tsx": "Reusable section heading with title and optional subtitle.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actor, refetching when identity changes.",
  "frontend/src/hooks/useAuthz.ts": "Hooks for fetching user role, admin status, profile, and saving profile via actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Hooks for fetching blog posts, individual posts, and submitting contact forms via actor.",
  "frontend/src/index.css": "Configures Tailwind layers and defines extensive CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with a banner, institute overview, and mission/vision/values cards.",
  "frontend/src/pages/AcademicPartnersPage.tsx": "Displays academic partners with a banner and grid of partner cards.",
  "frontend/src/pages/admin/AdminBlogEditorPage.tsx": "Provides an admin blog editor page with a placeholder editor card.",
  "frontend/src/pages/admin/AdminBlogsPage.tsx": "Shows admin blog management with a New Post button and a placeholder list of posts.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays the admin dashboard with cards linking to blog management, enquiries, and future analytics.",
  "frontend/src/pages/admin/AdminEnquiriesPage.tsx": "Renders an admin enquiries page with a placeholder list of recent enquiries.",
  "frontend/src/pages/admin/AdminEnquiryDetailPage.tsx": "Shows a detail view layout for a single enquiry with placeholder content.",
  "frontend/src/pages/BlogDetailPage.tsx": "Shows a single blog post with loading states, metadata, and HTML-rendered content.",
  "frontend/src/pages/BlogsListPage.tsx": "Lists blog posts with thumbnails, tags, and links, handling loading and empty states.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form with validation and submission plus institute contact info.",
  "frontend/src/pages/CoursesPage.tsx": "Shows course offerings with descriptive cards and links to apply.",
  "frontend/src/pages/EducationLoanPage.tsx": "Displays an education loan information page with a banner, partner banks, and loan benefits using cards and headings.",
  "frontend/src/pages/EligibilityPage.tsx": "Shows admission eligibility criteria for diploma and degree programs and includes a call-to-action button to apply.",
  "frontend/src/pages/EventsPage.tsx": "Renders a list of upcoming events with dates and descriptions using a grid of cards.",
  "frontend/src/pages/FacultyPage.tsx": "Lists faculty members with images, titles, and brief descriptions in a responsive card grid.",
  "frontend/src/pages/FaqPage.tsx": "Provides a FAQ section using an accordion with common questions and detailed answers.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero section, stats, and an about preview promoting courses and institute highlights.",
  "frontend/src/pages/IndustryVisitPage.tsx": "Shows information on industry visits and displays a grid of visit-related images.",
  "frontend/src/pages/InfrastructurePage.tsx": "Describes campus infrastructure with facility details and supporting images.",
  "frontend/src/pages/InternationalCoursesPage.tsx": "Page showcasing international study programs, tours, internships, and certifications offered by the institute.",
  "frontend/src/pages/InternshipPage.tsx": "Displays details about structured internships, partner hotels, career growth, and benefits with an application link.",
  "frontend/src/pages/LeadershipPage.tsx": "Introduces the institute’s leadership team with profiles and experience summaries.",
  "frontend/src/pages/NewsPage.tsx": "Renders a grid of recent news items with dates, titles, and short descriptions.",
  "frontend/src/pages/PlacementPage.tsx": "Outlines placement support, top recruiters, the placement process, and career development offerings.",
  "frontend/src/pages/ScholarshipTestPage.tsx": "Explains merit-based scholarship tiers and provides a link to register for the scholarship test.",
  "frontend/src/pages/TestimonialsPage.tsx": "Shows student testimonials with names, positions, and feedback presented in card format.",
  "frontend/src/pages/TrainingProgramPage.tsx": "Renders a public Training Programs page with a hero banner and a grid of training program cards.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, retrieving, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout settings, animations, and enabling plugins.",
  "project_state.json": "Project metadata describing goals, architecture, required images, and existing implemented features."
}